# Required
brew "direnv"


# Images
brew "ffmpeg"
brew "imagemagick"
brew "gifsicle"
brew "librsvg"

# Useful
brew "gettext"
brew "cmake"
brew "gh"
brew "jq"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "lazygit"
brew "eza" # ls alternative
brew "ninja"
brew "tree"
brew "watch"

# React Native
brew "fastlane"
brew "cocoapods"
brew "watchman"

# Android
cask "zulu@17"

# Vscode
vscode "adpyke.vscode-sql-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "firsttris.vscode-jest-runner"
vscode "geequlim.godot-tools"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "mrorz.language-gettext"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "yzhang.markdown-all-in-one"
